In [5]:
#Análise Exploratória de Dados (EDA)

In [6]:
##Carregamento de dados

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("pratica_pandas.csv")

In [3]:
import os
os.listdir()

['.idea',
 '.ipynb_checkpoints',
 '.venv',
 'AND, OR, IS, NOT.py',
 'BREAKS.py',
 'Exer.5.py',
 'exer.LOOP.py',
 'Github.py',
 'IF, ELIF, ELSE.py',
 'Jupyter.py',
 'LISTAS.py',
 'LOOP FOR.py',
 'LOOP WHILE.py',
 'Panda.py',
 'pratica_pandas.csv',
 'RANGES.py',
 'Revisão.py',
 'Untitled.ipynb',
 'untitled.py']

In [7]:
##Estrutura dos Dados

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       10 non-null     int64
 1   nome     10 non-null     object
 2   idade    8 non-null      float64
 3   cidade   9 non-null      object
 4   salario  8 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 532.0+ bytes

In [6]:
df.shape

(10, 5)

In [ ]:
##Estatística Descritiva

In [7]:
df.describe()

             id      idade      salario
count  10.00000   8.000000     8.000000
mean    5.50000  31.125000  4162.500000
std     3.02765   6.577831   908.589959
min     1.00000  22.000000  2800.000000
25%     3.25000  26.500000  3675.000000
50%     5.50000  30.500000  4250.000000
75%     7.75000  35.750000  4875.000000
max    10.00000  41.000000  5200.000000

In [ ]:
##Análise de Valores Ausentes

In [8]:
df.isna()

      id   nome  idade  cidade  salario
0  False  False  False   False    False
1  False  False  False   False    False
2  False  False   True   False    False
3  False  False  False   False     True
4  False  False  False   False    False
5  False  False  False   False    False
6  False  False   True   False    False
7  False  False  False   False    False
8  False  False  False    True    False
9  False  False  False   False     True

In [9]:
## Obtendo informações sobre os dados, procurando blocos vazios

In [10]:
df.isna().sum()

id         0
nome       0
idade      2
cidade     1
salario    2
dtype: int64

In [11]:
## Começando a preencher os dados com "fillna"

In [12]:
df["cidade"] = df["cidade"].fillna("Desconhecida")

In [13]:
df["idade"] = df["idade"].fillna(df["idade"].mean())

In [14]:
df["salario"] = df["salario"].fillna(df["salario"].mean())

In [15]:
df.isna().sum()

id         0
nome       0
idade      0
cidade     0
salario    0
dtype: int64

In [16]:
df

   id      nome   idade        cidade  salario
0   1       Ana  25.000            SP   3000.0
1   2     Bruno  32.000            RJ   4500.0
2   3    Carlos  31.125            SP   4000.0
3   4     Diana  29.000            MG   4162.5
4   5   Eduardo  41.000            RJ   5200.0
5   6  Fernanda  35.000            SP   4800.0
6   7   Gabriel  31.125            MG   3900.0
7   8    Helena  22.000            SP   2800.0
8   9      Igor  38.000  Desconhecida   5100.0
9  10     Julia  27.000            RJ   4162.5

In [17]:
## Iniciando a comparação de dados

In [18]:
df["salario"].mean()

np.float64(4162.5)

In [19]:
df["idade"].mean()

np.float64(31.125)

In [20]:
## O salário médio é R$4162,50 enquanto a idade média é de 31 anos

In [ ]:
## Análise por Cidade

In [21]:
df.groupby("cidade")["salario"].mean()

cidade
Desconhecida    5100.000000
MG              4031.250000
RJ              4620.833333
SP              3650.000000
Name: salario, dtype: float64

In [22]:
df.groupby("cidade")["idade"].mean()

cidade
Desconhecida    38.000000
MG              30.062500
RJ              33.333333
SP              28.281250
Name: idade, dtype: float64

In [23]:
df.groupby("cidade")["id"].mean()

cidade
Desconhecida    9.000000
MG              5.500000
RJ              5.666667
SP              4.500000
Name: id, dtype: float64

In [24]:
## É possível observar que Rio de Janeiro é o estado com maior média salarial, seguido de ser também com maior número de registros e com uma média de idade maior.

In [ ]:
## Comparação Salarial

In [25]:
df["salario"].describe()

count      10.000000
mean     4162.500000
std       801.301025
min      2800.000000
25%      3925.000000
50%      4162.500000
75%      4725.000000
max      5200.000000
Name: salario, dtype: float64

In [26]:
df[df["salario"] > df["salario"].mean()]

   id      nome  idade        cidade  salario
1   2     Bruno   32.0            RJ   4500.0
4   5   Eduardo   41.0            RJ   5200.0
5   6  Fernanda   35.0            SP   4800.0
8   9      Igor   38.0  Desconhecida   5100.0

In [27]:
df[df["salario"] < df["salario"].mean()]

   id     nome   idade cidade  salario
0   1      Ana  25.000     SP   3000.0
2   3   Carlos  31.125     SP   4000.0
6   7  Gabriel  31.125     MG   3900.0
7   8   Helena  22.000     SP   2800.0

In [ ]:
## Conclusão

In [28]:
## Ao analisar os salários, observa-se que o número de indivíduos acima e abaixo da média é equivalente, sugerindo uma distribuição relativamente equilibrada, sem a presença de valores extremamente discrepantes que distorçam a média.